app/Controllers/CourseController.php

SELECT *
FROM `courses`
---
    public function index()
    {
        $model = new CourseModel();
        $data['courses'] = $model->findAll();